In [1]:
import pandas as pd
import random
import numpy as np
from datetime import datetime, timedelta

# Define possible values
departments = ['HR', 'IT', 'Finance', 'Marketing', 'Sales', 'Operations', 'Admin']
names = ["Alice Johnson", "Bob Smith", "Charlie Davis", "David White", "Emma Wilson",
         "Frank Harris", "Grace Lee", "Henry Walker", "Isabella Scott", "Jack Hall",
         "Karen Allen", "Liam Wright", "Mia King", "Noah Baker", "Olivia Adams",
         "Paul Nelson", "Quinn Carter", "Ryan Mitchell", "Sophia Perez", "Thomas Roberts"]
num_rows = 100

np.random.seed(20)
# Generate employee dataset
data = {
    'Employee_ID': [f'EMP{1000+i}' for i in range(num_rows)],
    'Name': [random.choice(names) for _ in range(num_rows)],
    'Age': [random.randint(22, 60) for _ in range(num_rows)],
    'Department': [random.choice(departments) for _ in range(num_rows)],
    'Joining_Date': [(datetime.today() - timedelta(days=random.randint(0, 3650))).date() for _ in range(num_rows)],
    'Salary': [random.randint(30000, 150000) for _ in range(num_rows)],
    'Experience': [random.randint(0, 40) for _ in range(num_rows)],  # Years of experience
    'Performance_Score': [random.randint(1, 5) for _ in range(num_rows)],  # Rating from 1 to 5
    'Remote_Work_Eligible': [random.choice([True, False]) for _ in range(num_rows)]
}

# Create DataFrame
df = pd.DataFrame(data)

In [2]:
# Functions of DataFrames
# Str and Date in DataFrames
# Apply functions with DataFrames - Small
# Iterrows - Small
# Groupby 
# Groupby with apply and transform
# Pivot tables

In [3]:
df.head(20)

,Employee_ID,Name,Age,Department,Joining_Date,Salary,Experience,Performance_Score,Remote_Work_Eligible
0,EMP1000,David White,49,IT,2023-12-01,64368,23,1,False
1,EMP1001,David White,45,Finance,2017-03-04,64740,34,1,False
2,EMP1002,Emma Wilson,29,IT,2019-08-03,110292,10,1,True
3,EMP1003,Frank Harris,45,Admin,2022-10-31,82869,32,3,False
4,EMP1004,Bob Smith,33,Admin,2024-02-21,33020,38,1,False
5,EMP1005,Liam Wright,26,HR,2019-10-21,67325,12,1,True
6,EMP1006,Henry Walker,37,Sales,2024-10-22,141975,6,3,True
7,EMP1007,Jack Hall,25,HR,2018-08-21,33436,22,1,False
8,EMP1008,Sophia Perez,28,Sales,2019-02-13,104041,33,5,False
9,EMP1009,Emma Wilson,35,Operations,2018-09-02,111929,31,3,False
10,EMP1010,Grace Lee,42,Marketing,2022-12-08,33017,7,4,True
11,EMP1011,Grace Lee,47,Finance,2019-05-29,41088,37,4,True
12,EMP1012,Grace Lee,58,HR,2020-02-01,114987,35,1,True
13,EMP1013,Isabella Scott,49,Sales,2024-01-03,77649,22,5,False
14,EMP1014,David White,41,Finance,2023-05-22,120004,26,4,False
15,EMP1015,Olivia Adams,28,Marketing,2015-10-08,75872,18,1,False
16,EMP1016,Charlie Davis,26,Operations,2018-12-26,51018,33,4,True
17,EMP1017,Karen Allen,58,Sales,2023-10-11,113805,18,5,True
18,EMP1018,Jack Hall,51,Admin,2017-02-15,68569,9,3,True
19,EMP1019,Noah Baker,58,Marketing,2018-10-06,74990,8,3,False

In [4]:
# Use apply function on Salary and classify the salary as high medium and low
# if <50K - Low, if <80 - Medium else High
def func(x):
    if(x<50000):
        return 'Low'
    elif(x<80000):
        return 'Medium'
    else:
        return 'High'

In [5]:
df['salary_classification'] = df['Salary'].apply(func)

In [6]:
lst = df.loc[0].tolist()

In [7]:
# Use this list to reduce the salary by 10% if performance score <=2 -- it's okay to use index numbers, write a function
# write a function that takes list and returns updated salary basis above condition
def adjust_salary(lst):
    if(lst[7]<=2):
        return lst[5]*0.9
    else:
        return lst[5]

In [8]:
adjust_salary(lst)

57931.200000000004

In [9]:
ds = df.loc[0]
ds

Employee_ID                  EMP1000
Name                     David White
Age                               49
Department                        IT
Joining_Date              2023-12-01
Salary                         64368
Experience                        23
Performance_Score                  1
Remote_Work_Eligible           False
salary_classification         Medium
Name: 0, dtype: object

In [10]:
# Write the same function for Data Series - THe function takes Data Series as input and returns salary corrected
def adj_sal(S):
    if(S['Performance_Score']<=2):
        return S['Salary']*0.9
    else:
        return S['Salary']

In [11]:
adj_sal(ds)

57931.200000000004

In [12]:
df

,Employee_ID,Name,Age,Department,Joining_Date,Salary,Experience,Performance_Score,Remote_Work_Eligible,salary_classification
0,EMP1000,David White,49,IT,2023-12-01,64368,23,1,False,Medium
1,EMP1001,David White,45,Finance,2017-03-04,64740,34,1,False,Medium
2,EMP1002,Emma Wilson,29,IT,2019-08-03,110292,10,1,True,High
3,EMP1003,Frank Harris,45,Admin,2022-10-31,82869,32,3,False,High
4,EMP1004,Bob Smith,33,Admin,2024-02-21,33020,38,1,False,Low
...,...,...,...,...,...,...,...,...,...,...
95,EMP1095,Isabella Scott,33,IT,2017-04-11,97950,0,1,True,High
96,EMP1096,Emma Wilson,53,Admin,2021-04-27,142115,10,5,True,High
97,EMP1097,Noah Baker,59,IT,2022-08-12,36806,24,3,False,Low
98,EMP1098,Noah Baker,48,Marketing,2019-07-18,76510,10,1,True,Medium
99,EMP1099,Paul Nelson,33,IT,2024-03-15,108283,6,3,True,High

In [13]:
df.apply(adj_sal, axis = 1)

0      57931.2
1      58266.0
2      99262.8
3      82869.0
4      29718.0
        ...
95     88155.0
96    142115.0
97     36806.0
98     68859.0
99    108283.0
Length: 100, dtype: float64

In [14]:
# Retire by department - HR age >50 ->retire, Marketing age >40 -> retire, Department admin age>45 -> retire, don't return anything otherwise.
ds = df.loc[1]
ds

Employee_ID                  EMP1001
Name                     David White
Age                               45
Department                   Finance
Joining_Date              2017-03-04
Salary                         64740
Experience                        34
Performance_Score                  1
Remote_Work_Eligible           False
salary_classification         Medium
Name: 1, dtype: object

In [15]:
def decide_retirement(ds):
    if((ds['Department'] == 'HR') & (ds['Age']>50)):
        return 'retire'
    elif((ds['Department'] == 'Marketing') & (ds['Age']>40)):
        return 'retire'
    elif((ds['Department'] == 'Admin') & (ds['Age']>45)):
        return 'retire'
    else:
        return 'Do not retire'

In [16]:
df.apply(decide_retirement, axis = 1)      # axis=1 means apply this fuction in every row

0     Do not retire
1     Do not retire
2     Do not retire
3     Do not retire
4     Do not retire
          ...
95    Do not retire
96           retire
97    Do not retire
98           retire
99    Do not retire
Length: 100, dtype: object

In [17]:
# Question is cap the values of salary between 60000 and 100000 but you can't use 60000 and 10000 as numbers inside the function
#  use the bounds as variables

In [18]:
def func(x, lb, ub):
    if(x<lb):
        return lb
    elif(x>ub):
        return ub
    else:
        return x

In [19]:

new_func = lambda x: func(x, 60000, 100000)

In [20]:
# df['Salary'].apply(func(x, 50000, 90000))
lb = 50000
ub = 90000
df['Salary'].apply(lambda x: func(x, 50000, 90000))

0     64368
1     64740
2     90000
3     82869
4     50000
      ...
95    90000
96    90000
97    50000
98    76510
99    90000
Name: Salary, Length: 100, dtype: int64

In [21]:
lb = 50000
ub = 90000
df['Salary'].apply(func, lb = lb, ub = ub)

0     64368
1     64740
2     90000
3     82869
4     50000
      ...
95    90000
96    90000
97    50000
98    76510
99    90000
Name: Salary, Length: 100, dtype: int64

# Group By

In [22]:
import pandas as pd
import numpy as np

# Creating sample data
data = {
    "Customer_ID": np.random.randint(1001, 1050, 50),
    "City": np.random.choice(["New York", "Los Angeles", "Chicago", "Houston", "San Francisco"], 50),
    "Product_Category": np.random.choice(["Electronics", "Clothing", "Furniture", "Beauty", "Groceries"], 50),
    "Product": np.random.choice(["Laptop", "Shoes", "Table", "Face Cream", "Vegetables", "Headphones", "Sofa", "Jacket", "Smartphone"], 50),
    "Revenue": np.random.randint(50, 1000, 50),
    "Discount": np.random.randint(5, 30, 50),
    "Customer_Rating": np.round(np.random.uniform(1, 5, 50), 1),
    "Purchase_Date": pd.date_range(start="2024-01-01", periods=50, freq="D"),
}

# Creating the DataFrame
df = pd.DataFrame(data)

In [23]:
df = df.head(10)

In [24]:
df.to_clipboard()

In [25]:
grouped = df.groupby('City')

In [26]:
grouped.indices

{'Chicago': array([0, 1, 5, 7, 9], dtype=int64),
 'Houston': array([2, 3, 8], dtype=int64),
 'Los Angeles': array([6], dtype=int64),
 'New York': array([4], dtype=int64)}

In [27]:
grouped.groups

{'Chicago': [0, 1, 5, 7, 9], 'Houston': [2, 3, 8], 'Los Angeles': [6], 'New York': [4]}

In [28]:
grouped.ngroups

4

In [29]:
lst = [1,2,3]

In [30]:
dir(lst)

['__add__',
 '__class__',
 '__class_getitem__',
 '__contains__',
 '__delattr__',
 '__delitem__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__reversed__',
 '__rmul__',
 '__setattr__',
 '__setitem__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'append',
 'clear',
 'copy',
 'count',
 'extend',
 'index',
 'insert',
 'pop',
 'remove',
 'reverse',
 'sort']

In [31]:
# dir(grouped)

In [32]:
df.groupby('City')['Discount'].max()
df.groupby('City')[['Discount']].max().reset_index()
df.groupby('City')[['Discount']].max().reset_index(drop = True)

df.groupby('City')['Discount'].max().reset_index()

          City  Discount
0      Chicago        29
1      Houston        18
2  Los Angeles        21
3     New York         9

In [33]:
# For every product find min customer rating and min revenue
df.groupby('Product_Category')[['Customer_Rating', 'Revenue']].min()
# I don't want index - 
df.groupby('Product_Category')[['Customer_Rating', 'Revenue']].min().reset_index()

  Product_Category  Customer_Rating  Revenue
0           Beauty              3.7      360
1         Clothing              2.5      824
2      Electronics              3.0      381
3        Furniture              1.1      189
4        Groceries              1.7       54

In [34]:
# Slight problem - I'm getting the aggregated value column name same as actual column name
# What if I want a custom name like customer_rating_min
df.groupby('Product_Category').agg(customer_rating_min = ('Customer_Rating', 'min'), revenue_min = ('Revenue', 'min'))

                  customer_rating_min  revenue_min
Product_Category
Beauty                            3.7          360
Clothing                          2.5          824
Electronics                       3.0          381
Furniture                         1.1          189
Groceries                         1.7           54

In [35]:
# I want for each product category min of customer rating and max of revenue
# Can't be done normally
df.groupby('Product_Category')[['Customer_Rating', 'Revenue']].min()
# Can be done using agg
df.groupby('Product_Category').agg(customer_rating_min = ('Customer_Rating', 'min'), max_revenue = ('Revenue', 'max'))

                  customer_rating_min  max_revenue
Product_Category
Beauty                            3.7          360
Clothing                          2.5          824
Electronics                       3.0          381
Furniture                         1.1          687
Groceries                         1.7          877

In [36]:
# 1. Total Revenue and Average Discount per Product Category
df.groupby('Product_Category').agg(total_revenue = ('Revenue', 'sum'), avg_discount = ('Discount', 'mean'))

                  total_revenue  avg_discount
Product_Category
Beauty                      360           5.0
Clothing                    824           9.0
Electronics                 381          16.0
Furniture                  2062          19.0
Groceries                   931          13.5

In [37]:
# Number of Purchases and Average Customer Rating per City

# Session 2

In [38]:
# Next session 
# Group by apply Group by trasform 
# String operations and date operations
# Pivots

# Merge - on your own

In [39]:
import pandas as pd

data_small = {
    'Department': ['Sales', 'Sales', 'Sales', 'HR', 'HR', 'HR', 'IT', 'IT'],
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
    'Salary': [50000, 55000, 60000, 48000, 50000, 52000, 70000, 72000],
    'Experience': [2, 3, 5, 1, 2, 4, 6, 8]
}

df = pd.DataFrame(data_small)

In [40]:
df

  Department Employee  Salary  Experience
0      Sales        A   50000           2
1      Sales        B   55000           3
2      Sales        C   60000           5
3         HR        D   48000           1
4         HR        E   50000           2
5         HR        F   52000           4
6         IT        G   70000           6
7         IT        H   72000           8

In [41]:
# Find out how much each employees salary is more as compared to employee with minimum salary
df['Salary'] - df['Salary'].min()

0     2000
1     7000
2    12000
3        0
4     2000
5     4000
6    22000
7    24000
Name: Salary, dtype: int64

In [42]:
def diff_salary(x, min_salary):
    return x-min_salary
min_sal = df['Salary'].min()
df['Salary'].apply(diff_salary, min_salary = min_sal)

0     2000
1     7000
2    12000
3        0
4     2000
5     4000
6    22000
7    24000
Name: Salary, dtype: int64

In [43]:
def diff_salary_group(ds):
    return ds - ds.min()

In [44]:
# Find how much each employees salary is more than the person with minimum salary in the same department
df.groupby('Department')['Salary'].apply(diff_salary_group)

Department
HR          3        0
            4     2000
            5     4000
IT          6        0
            7     2000
Sales       0        0
            1     5000
            2    10000
Name: Salary, dtype: int64

In [45]:
def sample_apply(ds):
    print(ds)
    return pd.Series([0,1,2,3,4,5,6])

In [46]:
df.groupby('Department')['Salary'].apply(sample_apply)

3    48000
4    50000
5    52000
Name: HR, dtype: int64
6    70000
7    72000
Name: IT, dtype: int64
0    50000
1    55000
2    60000
Name: Sales, dtype: int64

Department
HR          0    0
            1    1
            2    2
            3    3
            4    4
            5    5
            6    6
IT          0    0
            1    1
            2    2
            3    3
            4    4
            5    5
            6    6
Sales       0    0
            1    1
            2    2
            3    3
            4    4
            5    5
            6    6
Name: Salary, dtype: int64

In [47]:
def diff_salary_group(ds):
    return (ds - ds.min()).mean()

In [48]:
# We get back a dataseries but with new indexes
df.groupby('Department')['Salary'].apply(diff_salary_group)
# We get back a dataframe with new indexes
df.groupby('Department')['Salary'].apply(diff_salary_group)

Department
HR       2000.0
IT       1000.0
Sales    5000.0
Name: Salary, dtype: float64

In [49]:
# 1. If the number of values going = no of values coming back the original indexes will become indexes of new values coming back
# 2. If the number of values going != no of values coming back then new indexes will be created by group names

In [50]:
def random_func(x):
    return x**2

df['Experience'].apply(random_func)
# Is there any group? - int will go and int will come back (dataseries will come back accumulated)

df.groupby('Department')['Experience'].apply(random_func)

# Is there a group? - Each group's data series will go, each group's data series will come back - indexes - Original index
df.groupby('Department')[['Experience']].apply(random_func)

# Tell me in all three what is the data type going in the function and coming from the function

              Experience
Department
HR         3           1
           4           4
           5          16
IT         6          36
           7          64
Sales      0           4
           1           9
           2          25

In [51]:
def random_fun(x):
    return x.mean()**2


df['Experience'].apply(random_func) 
# Error

df.groupby('Department')['Experience'].apply(random_func)
# Data Series will go, One value for each data series will come back - INdex - Group name - Combined to make a data series

df.groupby('Department')[['Experience']].apply(random_func)

              Experience
Department
HR         3           1
           4           4
           5          16
IT         6          36
           7          64
Sales      0           4
           1           9
           2          25

In [52]:
df

  Department Employee  Salary  Experience
0      Sales        A   50000           2
1      Sales        B   55000           3
2      Sales        C   60000           5
3         HR        D   48000           1
4         HR        E   50000           2
5         HR        F   52000           4
6         IT        G   70000           6
7         IT        H   72000           8

In [53]:
def random_func(x):
    return x['Experience']**2
    
df.apply(random_func, axis = 1)

0     4
1     9
2    25
3     1
4     4
5    16
6    36
7    64
dtype: int64

In [54]:
import numpy as np

np.random.seed(42)
data_large = {
    'Department': np.random.choice(['Sales', 'HR', 'IT', 'Finance'], 500),
    'Employee_ID': np.arange(1, 501),
    'Salary': np.random.randint(40000, 100000, 500),
    'Experience': np.random.randint(1, 15, 500),
    'Performance_Score': np.random.uniform(1, 5, 500)
}

df_large = pd.DataFrame(data_large)

In [55]:
df_large

    Department  Employee_ID  Salary  Experience  Performance_Score
0           IT            1   40190           1           3.305153
1      Finance            2   50492          11           3.426860
2        Sales            3   90132           5           2.696523
3           IT            4   75743          10           3.945777
4           IT            5   46102           9           4.737468
..         ...          ...     ...         ...                ...
495         IT          496   77892           8           1.418271
496         IT          497   41015           5           3.545721
497    Finance          498   99168           8           3.825903
498      Sales          499   67712          10           1.126345
499    Finance          500   74961           1           4.744849

[500 rows x 5 columns]

In [56]:
def adjust_salary(ds):
    if(ds.mean()<60000):
        return ds*1.1
    else:
        return ds

In [57]:
#  increase the salary of each employee by 10% if the avg salary of a department is less than 60000
df_large.loc[df_large['Department'] == 'IT']['Salary']
df_large.groupby('Department')['Salary'].apply(adjust_salary)

# When number of values going in and coming back are same, you can use transform instead of apply

Department
Finance     1      50492
            5      90336
            14     40569
            16     74663
            17     91885
                   ...
Sales       489    40009
            491    98141
            492    63793
            494    69548
            498    67712
Name: Salary, Length: 500, dtype: int32

In [58]:
#  increase the salary of each employee by 10% if the avg Performance_Score of a department is greater than 4

In [59]:
df.loc[df['Department'] == 'Sales']

  Department Employee  Salary  Experience
0      Sales        A   50000           2
1      Sales        B   55000           3
2      Sales        C   60000           5

In [60]:
def increase_salary(dff):
    if(dff['Performance_Score'].mean()>4):
        return dff['Salary'] * 1.1
    else:
        return dff['Salary']

In [61]:
df_large.groupby('Department').apply(increase_salary)

Department
Finance     1      50492
            5      90336
            14     40569
            16     74663
            17     91885
                   ...
Sales       489    40009
            491    98141
            492    63793
            494    69548
            498    67712
Name: Salary, Length: 500, dtype: int32

In [62]:
# apply - 
# 1. With Data series without grouping
# 2. With Data frame with axis without grouping
# 3. With grouping and Data series
# 4. With grouping and dataframe

In [63]:
# Question for each Department sample the data keeping only top 2 rows of each department
df[df['Department'] == 'Sales']

  Department Employee  Salary  Experience
0      Sales        A   50000           2
1      Sales        B   55000           3
2      Sales        C   60000           5

In [64]:
def sample_custom(df):
    return df.head(2)

In [65]:
df_large.groupby('Department').apply(sample_custom).reset_index(drop = True)

  Department  Employee_ID  Salary  Experience  Performance_Score
0    Finance            2   50492          11           3.426860
1    Finance            6   90336           6           4.702274
2         HR           10   66641          13           4.355592
3         HR           21   47455           5           2.333997
4         IT            1   40190           1           3.305153
5         IT            4   75743          10           3.945777
6      Sales            3   90132           5           2.696523
7      Sales            7   92479          11           2.803357

In [66]:
# Random sampling by department
def random_grp_sampling(dff):
    return dff.sample(2)

In [67]:
df_large.groupby('Department').apply(random_grp_sampling)

               Department  Employee_ID  Salary  Experience  Performance_Score
Department
Finance    339    Finance          340   88136           8           2.391237
           312    Finance          313   96418           5           3.371760
HR         307         HR          308   72307          12           1.615584
           431         HR          432   57640           7           1.124536
IT         167         IT          168   69124          14           2.904202
           459         IT          460   80251           3           4.190236
Sales      336      Sales          337   46801           1           2.922346
           352      Sales          353   63322           8           3.474446

In [68]:
# iqr = q3-q1

# Cap outliers group wise - i.e the values which are above 1.5*IQR, then cap it to 1.5*IQR
df['Salary'].quantile(0.25)

50000.0

In [69]:
def cap_groupwise(ds):
    IQR = ds.quantile(0.75) - ds.quantile(0.25)
    ds[ds>1.5*IQR] = 1.5*IQR 
    return ds

In [70]:
df_large.groupby('Department')['Salary'].apply(cap_groupwise)

C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1950000201.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '49908.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ds[ds>1.5*IQR] = 1.5*IQR
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1950000201.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '40079.25' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ds[ds>1.5*IQR] = 1.5*IQR
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1950000201.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '44052.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ds[ds>1.5*IQR] = 1.5*IQR
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1950000201.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '35517.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ds[ds>1.5*IQR] = 1.5*IQR

Department
Finance     1      49908.375
            5      49908.375
            14     40569.000
            16     49908.375
            17     49908.375
                     ...
Sales       489    35517.375
            491    35517.375
            492    35517.375
            494    35517.375
            498    35517.375
Name: Salary, Length: 500, dtype: float64

In [71]:
df[df['Department'] == 'Sales']

  Department Employee  Salary  Experience
0      Sales        A   50000           2
1      Sales        B   55000           3
2      Sales        C   60000           5

In [72]:
def cap_outliers(gr):
    Q1 = gr.quantile(0.25)
    Q3 = gr.quantile(0.75)
    IQR = Q3 - Q1
    cap = 1.5 * IQR
    gr[gr > cap] = cap 
    return gr

In [73]:
df_large.groupby(['Department'])['Salary'].apply(cap_outliers)

C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1148683531.py:6: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '49908.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  gr[gr > cap] = cap
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1148683531.py:6: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '40079.25' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  gr[gr > cap] = cap
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1148683531.py:6: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '44052.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  gr[gr > cap] = cap
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1148683531.py:6: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '35517.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  gr[gr > cap] = cap

Department
Finance     1      49908.375
            5      49908.375
            14     40569.000
            16     49908.375
            17     49908.375
                     ...
Sales       489    35517.375
            491    35517.375
            492    35517.375
            494    35517.375
            498    35517.375
Name: Salary, Length: 500, dtype: float64

In [74]:
def cap_outliers(dff):
    capiqr = (dff['Salary'].quantile(0.75) - dff['Salary'].quantile(0.25))*1.5
    dff.loc[dff['Salary']>capiqr, 'Salary'] =  capiqr
    return dff['Salary']

In [75]:
df_large.groupby('Department').apply(cap_outliers)

C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1401731004.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '49908.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  dff.loc[dff['Salary']>capiqr, 'Salary'] =  capiqr
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1401731004.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '40079.25' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  dff.loc[dff['Salary']>capiqr, 'Salary'] =  capiqr
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1401731004.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '44052.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  dff.loc[dff['Salary']>capiqr, 'Salary'] =  capiqr
C:\Users\Prajwal Wadhai\AppData\Local\Temp\ipykernel_13332\1401731004.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '35517.375' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  dff.loc[dff['Salary']>capiqr, 'Salary'] =  capiqr

Department
Finance     1      49908.375
            5      49908.375
            14     40569.000
            16     49908.375
            17     49908.375
                     ...
Sales       489    35517.375
            491    35517.375
            492    35517.375
            494    35517.375
            498    35517.375
Name: Salary, Length: 500, dtype: float64

In [76]:
def cap_num(ds):
    IQR=ds.quantile(0.75) - ds.quantile(0.25)
    ds[ds>1.5*IQR] = 1.5*IQR
    return ds

In [77]:
ds = df.loc[df['Department'] == 'Sales', 'Salary']

In [78]:
ds

0    50000
1    55000
2    60000
Name: Salary, dtype: int64

In [79]:
# Wrie a function to return the IQR of each group's Salary

In [80]:
def iqr(ds):
    return 1.5*(ds.quantile(0.75) - ds.quantile(0.25))

In [81]:
df_large.groupby('Department')['Salary'].apply(iqr)

Department
Finance    49908.375
HR         40079.250
IT         44052.375
Sales      35517.375
Name: Salary, dtype: float64

In [82]:
#another way to solve same question
df_large.groupby('Department').agg(salary_mean = ('Salary', 'mean'), salary_iqr = ('Salary', iqr))

             salary_mean  salary_iqr
Department
Finance     71376.040541   49908.375
HR          71423.009259   40079.250
IT          66972.557377   44052.375
Sales       68935.590164   35517.375

In [83]:
## Date time functions

In [84]:
import pandas as pd
import numpy as np

# Creating a DataFrame with random dates
np.random.seed(42)
date_rng = pd.date_range(start='2022-01-01', end='2024-12-31', freq='W')

df = pd.DataFrame({
    'Employee': np.random.choice(['A', 'B', 'C', 'D', 'E'], size=len(date_rng)),
    'Department': np.random.choice(['Sales', 'HR', 'IT'], size=len(date_rng)),
    'Join_Date': np.random.choice(date_rng, size=len(date_rng)),
    'Last_Promotion': np.random.choice(date_rng, size=len(date_rng)),
    'Salary': np.random.randint(40000, 120000, size=len(date_rng))
})

# Converting date columns to datetime
df['Join_Date'] = pd.to_datetime(df['Join_Date'])
df['Last_Promotion'] = pd.to_datetime(df['Last_Promotion'])

df.head()

  Employee Department  Join_Date Last_Promotion  Salary
0        D      Sales 2022-02-06     2022-07-17   78088
1        E      Sales 2023-11-19     2024-09-08  118752
2        C         IT 2024-05-12     2022-03-20   95284
3        E         IT 2022-09-11     2023-10-22   97043
4        E         HR 2022-06-12     2022-11-13   75547

In [85]:
df.dtypes

Employee                  object
Department                object
Join_Date         datetime64[ns]
Last_Promotion    datetime64[ns]
Salary                     int32
dtype: object

In [86]:
df['Join_Date'].dt.year

0      2022
1      2023
2      2024
3      2022
4      2022
       ...
152    2023
153    2023
154    2023
155    2022
156    2022
Name: Join_Date, Length: 157, dtype: int32

In [87]:
df['Join_Date'].dt.month

0       2
1      11
2       5
3       9
4       6
       ..
152     4
153     3
154     5
155    10
156    10
Name: Join_Date, Length: 157, dtype: int32

In [88]:
df['Join_Date'].dt.day

0       6
1      19
2      12
3      11
4      12
       ..
152     9
153    26
154    28
155    23
156    30
Name: Join_Date, Length: 157, dtype: int32

In [89]:
# If you want Name of the day
df['Join_Date'].dt.day_name()

0      Sunday
1      Sunday
2      Sunday
3      Sunday
4      Sunday
        ...
152    Sunday
153    Sunday
154    Sunday
155    Sunday
156    Sunday
Name: Join_Date, Length: 157, dtype: object

In [90]:
# Arithematic operations between dates
# Difference between Last promotion date and join date
(df['Last_Promotion'] - df['Join_Date'])
# THe data type of above is not integer - type is time delta
# To convert it to integer
(df['Last_Promotion'] - df['Join_Date']).dt.days

0      161
1      294
2     -784
3      406
4      154
      ...
152   -273
153    252
154   -231
155    784
156    707
Length: 157, dtype: int64

In [91]:
# Finding the gap in months year and days
(df['Last_Promotion'].dt.to_period('M') - df['Join_Date'].dt.to_period('M')).apply(lambda x: x.n)

0       5
1      10
2     -26
3      13
4       5
       ..
152    -9
153     9
154    -7
155    26
156    24
Length: 157, dtype: int64

In [92]:
df['Last_Promotion'].dt.month_name()

0           July
1      September
2          March
3        October
4       November
         ...
152         July
153     December
154      October
155     December
156      October
Name: Last_Promotion, Length: 157, dtype: object

In [93]:
# Changing the format of Date
df['Join_Date'].dt.strftime('%A,%B,%Y')

0       Sunday,February,2022
1       Sunday,November,2023
2            Sunday,May,2024
3      Sunday,September,2022
4           Sunday,June,2022
               ...
152        Sunday,April,2023
153        Sunday,March,2023
154          Sunday,May,2023
155      Sunday,October,2022
156      Sunday,October,2022
Name: Join_Date, Length: 157, dtype: object

In [94]:
# FInd the employees where last promotion date was on a weekend
lolo = df['Last_Promotion'].dt.day_name().isin(['Sunday', 'Saturday'])
df[lolo]

    Employee Department  Join_Date Last_Promotion  Salary
0          D      Sales 2022-02-06     2022-07-17   78088
1          E      Sales 2023-11-19     2024-09-08  118752
2          C         IT 2024-05-12     2022-03-20   95284
3          E         IT 2022-09-11     2023-10-22   97043
4          E         HR 2022-06-12     2022-11-13   75547
..       ...        ...        ...            ...     ...
152        A      Sales 2023-04-09     2022-07-10  104291
153        A         HR 2023-03-26     2023-12-03  119104
154        C      Sales 2023-05-28     2022-10-09   99399
155        A         HR 2022-10-23     2024-12-15  119714
156        D      Sales 2022-10-30     2024-10-06   90428

[157 rows x 5 columns]

In [95]:
# pd.to_datetime
# 2022-02-06 -- this is the right format for pandas

x = '23-06-2024' 
# This needs to be converted

current_format = '%d-%m-%Y'
pd.to_datetime(x, format = current_format).to_pydatetime()

datetime.datetime(2024, 6, 23, 0, 0)

In [96]:
df = pd.DataFrame({'Date1': ['23-03-2024', '23-04-2025', '24-05-2025']})

In [97]:
pd.to_datetime(df['Date1'], format = current_format).dt.day_name()

0     Saturday
1    Wednesday
2     Saturday
Name: Date1, dtype: object